# Development tools
brew "buf"
brew "cfssl"
brew "gh"
brew "git"
brew "git-lfs"
brew "git-review"
brew "gnupg"
brew "pinentry"
brew "pinentry-mac"
brew "yq"
brew "zsh-completions"

# GUI applications
cask "chatgpt"
cask "postman"
cask "testcontainers-desktop"
cask "visual-studio-code"

# VS Code extensions - Core editing and UI
vscode "aaron-bond.better-comments"
vscode "christian-kohler.path-intellisense"
vscode "codezombiech.gitignore"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.code-runner"
vscode "jerrygoyal.shortcut-menu-bar"
vscode "patbenatar.advanced-new-file"
vscode "tariky.easy-snippet-maker"
vscode "vscode-icons-team.vscode-icons"
vscode "wayou.vscode-todo-highlight"

# VS Code extensions - Git and GitHub
vscode "eamodio.gitlens"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"

# VS Code extensions - Docker and containers
vscode "docker.docker"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"

# VS Code extensions - Remote development
vscode "coder.coder-remote"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"

# VS Code extensions - Language support
vscode "pbkit.vscode-pbkit"
vscode "redhat.vscode-commons"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"

# VS Code extensions - Markdown
vscode "bierner.github-markdown-preview"
vscode "bierner.markdown-checkbox"
vscode "bierner.markdown-emoji"
vscode "bierner.markdown-footnotes"
vscode "bierner.markdown-mermaid"
vscode "bierner.markdown-preview-github-styles"
vscode "bierner.markdown-yaml-preamble"
vscode "bpruitt-goddard.mermaid-markdown-syntax-highlighting"
vscode "davidanson.vscode-markdownlint"
vscode "tomoyukim.vscode-mermaid-editor"

# VS Code extensions - Testing and debugging
vscode "hbenl.vscode-test-explorer"
vscode "ms-vscode.test-adapter-converter"

# VS Code extensions - Other utilities
vscode "mechatroner.rainbow-csv"
vscode "mindaro-dev.file-downloader"
vscode "minherz.copyright-inserter"
vscode "ms-edgedevtools.vscode-edge-devtools"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.remote-server"
vscode "openai.chatgpt"
vscode "tomoki1207.pdf"
vscode "wdhongtw.gpg-indicator"
